# 1. Вывести текстом прямоугольник размером m на n состоящий, из единиц.n = int(input('Ввести ширину прямоугольника: '))m = int(input('Введите длину прямоугольника: '))pr = []for i in range(m):    dlin = ''    if i == 0 or i == m - 1:        for j in range(n):            dlin += '1'        pr.append(dlin)    else:        for k in range(n):            if k == 0 or k == n - 1:                dlin += '1'            else:                dlin += ' '        pr.append(dlin)for i in pr:    print(i)